// src/config.js
export const invitationConfig = {
  coupleNames: "إيلي و ماري تيريز",
  invitationText: "ندعوكم لحضور حفل زفافنا",
  date: "12 اب 2026",
  location: "فندق الريتز كارلتون، بيروت",
  backgroundColor: "#fce5cd",
  textColor: "#5d4037",
  fontFamily: "Cairo, sans-serif",
  buttonColor: "#d32f2f",
  quote: "اِثْنَانِ خَيْرٌ مِنْ وَاحِدٍ، لأَنَّ لَهُمَا أُجْرَةً لِتَعَبِهِمَا صَالِحَةً. لأَنَّهُ إِنْ وَقَعَ أَحَدُهُمَا يُقِيمُهُ رَفِيقُهُ. وَوَيْلٌ لِمَنْ هُوَ وَحْدَهُ إِنْ وَقَعَ، إِذْ لَيْسَ ثَانٍ لِيُقِيمَهُ",//"الحب هو أن تجد روحك في شخص آخر",
  invitationText: "اِثْنَانِ خَيْرٌ مِنْ وَاحِدٍ، لأَنَّ لَهُمَا أُجْرَةً لِتَعَبِهِمَا صَالِحَةً. لأَنَّهُ إِنْ وَقَعَ أَحَدُهُمَا يُقِيمُهُ رَفِيقُهُ. وَوَيْلٌ لِمَنْ هُوَ وَحْدَهُ إِنْ وَقَعَ، إِذْ لَيْسَ ثَانٍ لِيُقِيمَهُ",
  weddingDate: "2026-09-20T18:00:00",
  images: {
    backgroundImage: "/public/icons.svg",
  },
};